app/controllers/urls_controller.rb

  def create
    @url = Url.new(url_params)
    @url.save
---
INSERT INTO "urls" ("checksum", "created_at", "original", "updated_at") VALUES (?, ?, ?, ?)